Hi @gdavison ,
Thanks for the suggestion.
I also tried to create a state file using the command `terraform import module.zones.aws_route53_zone.this Z0164055395PYJGV5XHX1` and it creates the file and when I run again `terraform plan` it shows me below output

```
module.zones.aws_route53_zone.this: Refreshing state... [id=Z0164055395PYJGV5XHX1]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # null_resource.route53-validation will be created
  + resource "null_resource" "route53-validation" {
      + id = (known after apply)
    }

  # module.zones.aws_route53_zone.this will be destroyed
  - resource "aws_route53_zone" "this" {
      - comment      = "for testing" -> null
      - id           = "Z0164055395PYJGV5XHX1" -> null
      - name         = "test.corp.amdocs.aws" -> null
      - name_servers = [
          - "ns-0.awsdns-00.com.",
          - "ns-1024.awsdns-00.org.",
          - "ns-1536.awsdns-00.co.uk.",
          - "ns-512.awsdns-00.net.",
        ] -> null
      - tags         = {} -> null
      - tags_all     = {} -> null
      - zone_id      = "Z0164055395PYJGV5XHX1" -> null

      - vpc {
          - vpc_id     = "vpc-0100c890079a1a7fe" -> null
          - vpc_region = "eu-west-1" -> null
        }
      - vpc {
          - vpc_id     = "vpc-bd6a58d9" -> null
          - vpc_region = "eu-west-1" -> null
        }
    }

  # module.zones.aws_route53_zone.this["test.corp.amdocs.aws"] will be created
  + resource "aws_route53_zone" "this" {
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "test.corp.amdocs.aws"
      + name_servers  = (known after apply)
      + tags_all      = (known after apply)
      + zone_id       = (known after apply)

      + vpc {
          + vpc_id     = "vpc-0100c890079a1a7fe"
          + vpc_region = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + route53_zone_name_servers = {
      + test.corp.amdocs.aws = (known after apply)
    }
  + route53_zone_zone_id      = {
      + test.corp.amdocs.aws = (known after apply)
    }
```
if I tried to perform the same thing on r53 which is created by terraform i don't see destroy and this is what I am not getting why this is happening.
And also I am new to terraform.